using AsyncAwaitTaskPv421.Models;

new Game().Run();


/**
*  Гра - "Galaxian
*  Чотири ворога
*  Гравеь внизу екрану. Керування стрілками вліво, вправо
*  Пробіл - стріляти
*  Одночасно може бути 1 снаряд
*  Якщо снаряд влучив у ворога - ворог знищується
*  Якщо ворог дійшов до гравця - гра закінчується
*  Якщо гравець знищив всіх ворогів - гра закінчується
* 
*      [=]   [=]    [=]      [=]
* 
*                        |
* 
*                        ^
*                        
*/

/**
 * 1. Щоб з якоюсь вірогідністю вороги скидали бомби
 * Якщо бомба влучила в гравця - гра закінчується
 * 
 * 2. Вороги вибухають після влучення ракети
 * 
 * 3 кадри
 *                    *
 *                   ***
 *                   
 *                    * * *
 *                  *  * * 
 *                    * * *
 *                    
 *                     *
 *                *  *  *
 *                   *
 * 
 */ 